Hi Guys,<br>
Welcome back, let's learn another key and very useful concept in pandas!
# Groupby

Groupby is one of the most important and key functionality in pandas. It allows us to group data together, call aggregate functions and combine the results in three steps *split-apply-combine*: <br>
Before we move on to the hands-on, let's try to understand how this split-apply-combine work, using a data in different colours!

* **Split:** In this process, data contained in a pandas object (e.g. Series, DataFrame) is split into groups based on one or more keys that we provide. The splitting is performed on a particular axis of an object. For example, a DataFrame can be grouped on its rows (axis=0) or its columns (axis=1). <br>
* **apply:** Once splitting is done, a function is applied to all groups independently, producing a new value.
* **combine:** Finally, the results of all those functions applications are combined into a resultant object. The form of the resulting object will usually depend on what's being done to the data.<br>

Lets explore with some examples:

In [2]:
import pandas as pd

Let's create a dictionary and convert that into pandas dataframe

In [3]:
# Create a dataframe
data = {'Store':['Dhaka','Dhaka','Khulna','Khulna','Rajshahi','Rajshahi'],
       'Customer':['Tim','Jermy','Mark','Denice','Ray','Sam'],
       'Sales':[150,200,550,90,430,120]}
df = pd.DataFrame(data)
df

      Store Customer  Sales
0     Dhaka      Tim    150
1     Dhaka    Jermy    200
2    Khulna     Mark    550
3    Khulna   Denice     90
4  Rajshahi      Ray    430
5  Rajshahi      Sam    120

In the df, we have a Customer unique name, Sales in numbers and store name. <br>
Let's group the data, in df, based on column "Store" using groupby method. This will create a DataFrameGroupBy object.

Grab the df, access the gropby method using "." and pass the column we want to group the data on. <br>
Notice, we get a groupby object, stored in a memory 0x....

In [4]:
df.groupby('Store')[['Sales']].sum()

          Sales
Store
Dhaka       350
Khulna      640
Rajshahi    550

In [5]:
df.groupby("Store")[['Sales']].mean()

          Sales
Store
Dhaka     175.0
Khulna    320.0
Rajshahi  275.0

Let's save the created object as a new variable.

In [6]:
by_store = df.groupby("Store")

Now, we have grouped data in "by_store" object, we can call aggregate method on this object.

In [7]:
df.groupby("Store").sum()

            Customer  Sales
Store
Dhaka       TimJermy    350
Khulna    MarkDenice    640
Rajshahi      RaySam    550

In [8]:
by_store.sum()
#mean1 = by_store.mean()

            Customer  Sales
Store
Dhaka       TimJermy    350
Khulna    MarkDenice    640
Rajshahi      RaySam    550

Pandas will apply `mean()` on number columns "Sales". It ignore not numeric columns automatically. Same is True for sum, std, max, and so on..

In [9]:
# The steps above in a sinlge line code
df.groupby('Store').mean()

TypeError: agg function failed [how->mean,dtype->object]

Notice that, the result is a dataframe with "Store" as index and "Sales" as column. We can use loc method to locate any value for certain company after aggregation function. This will give us the value (e.g. sales) for a single store.

In [ ]:
# In oneline code
df.groupby('Store')[['Sales']].mean()

          Sales
Store
Dhaka     175.0
Khulna    320.0
Rajshahi  275.0

We can perform whole lots of aggregation operations on "by_store" object.

In [ ]:
df

      Store Customer  Sales
0     Dhaka      Tim    150
1     Dhaka    Jermy    200
2    Khulna     Mark    550
3    Khulna   Denice     90
4  Rajshahi      Ray    430
5  Rajshahi      Sam    120

In [ ]:
by_store.min()

         Customer  Sales
Store
Dhaka       Jermy    150
Khulna     Denice     90
Rajshahi      Ray    120

In [ ]:
by_store.max()

         Customer  Sales
Store
Dhaka         Tim    200
Khulna       Mark    550
Rajshahi      Sam    430

In [ ]:
by_store[['Sales']].std()

               Sales
Store
Dhaka      35.355339
Khulna    325.269119
Rajshahi  219.203102

In [ ]:
# count the no of instances in the columns, works with strings as well
# we have 2 customers and 2 sales in each store
by_store.count()

          Customer  Sales
Store
Dhaka            2      2
Khulna           2      2
Rajshahi         2      2

describe is a useful method, that gives a bunch of useful information, such as, mean, min, quartile values etc for each company.

In [ ]:
by_store[['Sales']].describe()

         Sales
         count   mean         std    min    25%    50%    75%    max
Store
Dhaka      2.0  175.0   35.355339  150.0  162.5  175.0  187.5  200.0
Khulna     2.0  320.0  325.269119   90.0  205.0  320.0  435.0  550.0
Rajshahi   2.0  275.0  219.203102  120.0  197.5  275.0  352.5  430.0

Let's use `transpose()` after describe so that the output looks good!

In [ ]:
by_store.describe().transpose()

Store             Dhaka      Khulna    Rajshahi
Sales count    2.000000    2.000000    2.000000
      mean   175.000000  320.000000  275.000000
      std     35.355339  325.269119  219.203102
      min    150.000000   90.000000  120.000000
      25%    162.500000  205.000000  197.500000
      50%    175.000000  320.000000  275.000000
      75%    187.500000  435.000000  352.500000
      max    200.000000  550.000000  430.000000

We can call a column name for a selected store to separate information with `transpose()` as well!

# Great Job!
Let's have a quick over view before we move on to the next section.